import java.util.Scanner;

public class Main {
    public static void main(String[] args) {

        //Задача 2
        //
        //Вводится положительное целое число, найдите сумму его цифр.

        Scanner sc = new Scanner(System.in);//включили сканнер

       /* System.out.println("Please input integer number");//запрашиваем ввод числа
        int n = sc.nextInt();//ввод числа
        int sum = 0;//переменная суммы

        while (n > 0) {
            sum += n % 10;
            n /= 10;


        }
        System.out.println(sum);*/


        //задача №3








    }
}